Revit 2024 API
PointCloudEngineRegistry.RegisterPointCloudEngine Method
 Registers a new point cloud engine and associates it to a particular file extension.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static void RegisterPointCloudEngine(
	string identifier,
	IPointCloudEngine engine,
	bool isFileBased
)
Visual Basic
Public Shared Sub RegisterPointCloudEngine ( _
	identifier As String, _
	engine As IPointCloudEngine, _
	isFileBased As Boolean _
)
Visual C++
public:
static void RegisterPointCloudEngine(
	String^ identifier,
	IPointCloudEngine^ engine,
	bool isFileBased
)
Parameters
identifier
Type: System.String
 A string that distinguishes the engine being registered. If isFileBased is true, this should be the file extension (e.g. "rcs" or "rcp"). If isFileBased is false, this identifier is used only by API calls and should be unique.
engine
Type: Autodesk.Revit.DB.PointClouds.IPointCloudEngine
 The point cloud engine that governs point clouds matching the input identifier.
isFileBased
Type: System.Boolean
 Indicates to Revit if a single Point Cloud corresponds to a single file on disk.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The same identifier has already been registered by another engine.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PointCloudEngineRegistry Class
Autodesk.Revit.DB.PointClouds Namespace